// Вопросы к этому заданию
// Чему равно а, почему?



// let a = 0 || 'string';

// let a = 1 && 'string';

// let a = null || 25;

// let a = null && 25;

// let a = null || 0 || 35;

// let a = null && 0 && 35;
// console.log(a);

// 1. 'string'  // false || true, оператор ИЛИ вернет первое true
// 2. 'string' // true  || true, оператор И  вернет последнее true
// 3. 25 // false || true, оператор ИЛИ вернет первое true
// 4. null  // false || true, оператор И запинается на первом false 
// 5. 35 // false || false || true, оператор ИЛИ вернет первое true
// 6. null  // false || false || true, оператор И запинается на первом false 

// Что отобразится в консоли. Почему?



// 12 + 14 + '12'

// 3 + 2 - '1'

// '3' + 2 - 1

// true + 2

// +'10' + 1

// undefined + 2

// null + 5

// true + undefined



// Создать произвольную переменную, присвоеть ей значение и написать условие, если переменная равна “hidden”,
// присвоить ей значение “visible”, иначе - “hidden”.

// Создать переменную и присвойте ей число.

// Используя if, записать условие:

// - если переменная равна нулю, присвоить ей 1;

// - если меньше нуля - строку “less then zero”;

// - если больше нуля - используя оператор “присвоение”, переменную умножить на 10 (использовать краткую запись).

// Дан объект let car = { name: 'Lexus', age: 10, create: 2008, needRepair: false }.

// Написать условие если возраст машины больше 5 лет то нужно вывести в консоль сообщение 'Need Repair'
// и свойство needRepair в объекте car изменить на true; иначе изменить на false.

// Дан объект let item = { name: 'Intel core i7', price: '100$', discount: '15%' }.

// Написать условие если у item есть поле discount и там есть значение которое не NaN а также есть поле
// price значение которого также не NaN то в объекте item создать поле priceWithDiscount и записать туда цену
// с учетом скидки и вывести ее в консоль, обратите внимание что поля discount и price это строки и вам из них нужно
// получить числа чтобы выполнить расчет.иначе если поля discount нет то вывести просто поле price в консоль.



// Дан следующий код:

// let product = {

// name: “Яблоко”,

// price: “10$”

// };



// let min = 10; // минимальная цена

// let max = 20; // максимальная цена



// Написать условие если цена товара больше или равна минимальной цене и меньше или равна максимальной цене то вывести
// в консоль название этого товара, иначе вывести в консоль что товаров не найдено.